<?php
//配置文件
return [
    'weixin_appid'=>'wx11a3b0bdb8cd5dff',
    'weixin_appsecret'=>'5fdb7a1b8b63430f5bbb1dbd162c1341',

    /**
     * ************************************
     * 开发模式 development | production
     * ************************************
     */
    'mode' => 'development' ,

    /**
     * *****************************
     * 图片相关
     * *****************************
     */
    // 图片上传目录
    'image_dir' => base_path() . 'public/static/upload/' ,
    // 是否保留图片原名
    'is_save_origin' => true ,

    /**
     * **********************
     * 用户相关
     * **********************
     */
    // app 支持的用户等级
    'user_level'=>[
        5 => "服务商",
        6 => "经纪人"
    ],
    // 用户实名认证状态
    'realname_auth_status' => [
        0 => '未实名' ,
        1 => '审核中' ,
        2 => '已经实名' ,
        9 => '审核不通过' ,
    ] ,

    /**
     * ****************************
     * 资金相关
     * ****************************
     */
    // 最低提现金额
    'min_cash_withdrawal' => 100 ,
    // 单次交易服务费，单位：元
    'service_fee' => 1 ,
    // 智能还款：单笔最低代还金额
    'min_per_repayment_money' => 500 ,
    // 智能还款：单次最低代扣金额
    'min_trans_money' => 100 ,
    // 智能还款：单次最低手续费
    'min_trans_fee' => 0 ,
    // 收益类型
    'income_type' => [
        1 => '分润' ,
        2 => '返佣' ,
    ] ,
    // 单笔中的消费次数
    'single_trans_count' => 2 ,
    // 每日限制最高还款笔数
    'repay_count_for_day' => 2 ,
    // 提现记录
    'withdraw_status' => [
        1 => '提交审核' ,
        2 => '审核通过' ,
        3 => '已出款' ,
        4 => '退回'
    ] ,

    /**
     * ***************************
     * 排序相关
     * ***************************
     */
    // 权重
    'sort' => 0 ,

    /**
     * *****************************
     * 智能还款相关
     * *****************************
     */
    // 自选行业
    'mcc' => [
        11 => '餐饮酒店' ,
        12 => '家居建材' ,
        13 => '百货超市' ,
        14 => '快捷便民' ,
        15 => '母婴服饰' ,
        16 => '家政中介' ,
        17 => '珠宝首饰' ,
        18 => '旅游美容'
    ] ,
    // 计划状态
    'repayment_plan_status' => [
        0 => '已保存' ,
        1 => '执行中' ,
        2 => '执行成功' ,
        9 => '执行失败'
    ] ,
    // 计划订单状态
    'repayment_order_status' => [
        1 => '执行中' ,
        2 => '执行成功' ,
        3 => '部分成功' ,
        4 => '提交失败' ,
        9 => '执行失败'
    ] ,
    // 计划订单中单条记录状态
    'repayment_detail_status' => [
        1 => '执行中' ,
        2 => '执行成功' ,
        9 => '执行失败'
    ] ,
    // 交易类型
    'repayment_trans_type' => [
        1 => '消费账单' ,
        2 => '还款账单'
    ] ,

    /**
     * **********************
     * 连接相关
     * **********************
     */
    'share_register_url' => 'http://h5t.xinzhima.cn/mobile/Login/registerView' ,

    /**
     * **********************
     * 邮箱相关
     * **********************
     */
    'user_mailbox' => '' ,
];